data/pipeFlowCoarse/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       175;
    }
    inlet
    {
        type            patch;
        nFaces          5;
        startFace       215;
    }
    outlet
    {
        type            patch;
        nFaces          5;
        startFace       220;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          100;
        startFace       225;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          100;
        startFace       325;
    }
)

// ************************************************************************* //
