data/pipeFlowCoarse/baseCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                 Euler;
}

gradSchemes
{
    default                 Gauss linear;
    "grad\(p.*\)"           Gauss linear;
}

divSchemes
{
    default                 		none;
    "div\(phi.*,U.*\)"      		Gauss linearUpwind grad(U);
    div((nuEff*dev2(T(grad(U)))))	Gauss linear;
    div((nu*dev2(T(grad(U)))))  	Gauss linear;
    div((nuM*grad(U)))          	Gauss linear;
}

laplacianSchemes
{
    default                 Gauss linear corrected;
}

interpolationSchemes
{
    default                 linear;
}

snGradSchemes
{
    default                 corrected;
}

fluxRequired
{
    default         no;
    p               ;
}

// ************************************************************************* //
